#### Terraform Plan 📋
```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.main will be created
  + resource "aws_api_gateway_deployment" "main" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_key_parameters    = [
          + "method.request.path.proxy",
        ]
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.root will be created
  + resource "aws_api_gateway_integration" "root" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method.root will be created
  + resource "aws_api_gateway_method" "root" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_settings.proxy_cache will be created
  + resource "aws_api_gateway_method_settings" "proxy_cache" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = 300
          + caching_enabled                            = true
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "OFF"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.main will be created
  + resource "aws_api_gateway_rest_api" "main" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Clarity Platform - Securities Scores API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "clarity-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name" = "clarity-api"
        }
      + tags_all                     = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api"
          + "Project"     = "clarity"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.v1 will be created
  + resource "aws_api_gateway_stage" "v1" {
      + arn                   = (known after apply)
      + cache_cluster_enabled = true
      + cache_cluster_size    = "0.5"
      + deployment_id         = (known after apply)
      + execution_arn         = (known after apply)
      + id                    = (known after apply)
      + invoke_url            = (known after apply)
      + rest_api_id           = (known after apply)
      + stage_name            = "v1"
      + tags                  = {
          + "Name" = "clarity-api-v1"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api-v1"
          + "Project"     = "clarity"
        }
      + web_acl_arn           = (known after apply)
    }

  # aws_cloudwatch_log_group.api_gateway will be created
  + resource "aws_cloudwatch_log_group" "api_gateway" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigateway/clarity-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "clarity-api-gateway-logs"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api-gateway-logs"
          + "Project"     = "clarity"
        }
    }

  # aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/clarity-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Name" = "clarity-api-logs"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api-logs"
          + "Project"     = "clarity"
        }
    }

  # aws_dynamodb_table.securities will be created
  + resource "aws_dynamodb_table" "securities" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "security_id"
      + id               = (known after apply)
      + name             = "clarity-securities"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clarity-securities"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-securities"
          + "Project"     = "clarity"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "security_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }
    }

  # aws_dynamodb_table_item.securities["AAPL"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "78"
                }
              + governance_score    = {
                  + N = "84.1"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Apple Inc."
                }
              + overall_score       = {
                  + N = "82.5"
                }
              + security_id         = {
                  + S = "AAPL"
                }
              + social_score        = {
                  + N = "85.3"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["AMZN"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "65.2"
                }
              + governance_score    = {
                  + N = "78.6"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Amazon.com Inc."
                }
              + overall_score       = {
                  + N = "74.1"
                }
              + security_id         = {
                  + S = "AMZN"
                }
              + social_score        = {
                  + N = "78.5"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["GOOGL"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "72.5"
                }
              + governance_score    = {
                  + N = "78.9"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Alphabet Inc."
                }
              + overall_score       = {
                  + N = "76.8"
                }
              + security_id         = {
                  + S = "GOOGL"
                }
              + social_score        = {
                  + N = "79"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["JPM"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "70"
                }
              + governance_score    = {
                  + N = "83.2"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "JPMorgan Chase & Co."
                }
              + overall_score       = {
                  + N = "77.9"
                }
              + security_id         = {
                  + S = "JPM"
                }
              + social_score        = {
                  + N = "80.5"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["META"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "69"
                }
              + governance_score    = {
                  + N = "79"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Meta Platforms Inc."
                }
              + overall_score       = {
                  + N = "71.3"
                }
              + security_id         = {
                  + S = "META"
                }
              + social_score        = {
                  + N = "65.8"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["MSFT"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "91"
                }
              + governance_score    = {
                  + N = "89"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Microsoft Corporation"
                }
              + overall_score       = {
                  + N = "89.2"
                }
              + security_id         = {
                  + S = "MSFT"
                }
              + social_score        = {
                  + N = "87.5"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["NVDA"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "75.5"
                }
              + governance_score    = {
                  + N = "84.5"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "NVIDIA Corporation"
                }
              + overall_score       = {
                  + N = "80.7"
                }
              + security_id         = {
                  + S = "NVDA"
                }
              + social_score        = {
                  + N = "82"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_dynamodb_table_item.securities["TSLA"] will be created
  + resource "aws_dynamodb_table_item" "securities" {
      + hash_key   = "security_id"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + environmental_score = {
                  + N = "85"
                }
              + governance_score    = {
                  + N = "67.8"
                }
              + last_updated        = {
                  + S = "2026-03-15T10:30:00Z"
                }
              + name                = {
                  + S = "Tesla Inc."
                }
              + overall_score       = {
                  + N = "68.4"
                }
              + security_id         = {
                  + S = "TSLA"
                }
              + social_score        = {
                  + N = "52.3"
                }
            }
        )
      + table_name = "clarity-securities"
    }

  # aws_ecr_lifecycle_policy.api will be created
  + resource "aws_ecr_lifecycle_policy" "api" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "clarity-api"
    }

  # aws_ecr_repository.api will be created
  + resource "aws_ecr_repository" "api" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "clarity-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "clarity-api"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api"
          + "Project"     = "clarity"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role.lambda_execution will be created
  + resource "aws_iam_role" "lambda_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clarity-lambda-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::383941188659:policy/candidate"
      + tags                  = {
          + "Name" = "clarity-lambda-execution-role"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-lambda-execution-role"
          + "Project"     = "clarity"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.lambda_dynamodb will be created
  + resource "aws_iam_role_policy" "lambda_dynamodb" {
      + id          = (known after apply)
      + name        = "clarity-lambda-dynamodb-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_logs will be created
  + resource "aws_iam_role_policy" "lambda_logs" {
      + id          = (known after apply)
      + name        = "clarity-lambda-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:eu-west-1:*:*"
                      + Sid      = "CloudWatchLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_function.api will be created
  + resource "aws_lambda_function" "api" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "clarity-api"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "clarity-api"
        }
      + tags_all                       = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api"
          + "Project"     = "clarity"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"             = "production"
              + "LOG_LEVEL"               = "INFO"
              + "POWERTOOLS_SERVICE_NAME" = "clarity-api"
              + "SECURITIES_TABLE"        = "clarity-securities"
            }
        }
    }

  # aws_lambda_permission.api_gateway will be created
  + resource "aws_lambda_permission" "api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "clarity-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_wafv2_web_acl.api will be created
  + resource "aws_wafv2_web_acl" "api" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF for Clarity Platform API - rate limiting"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "clarity-api-waf"
      + name_prefix                 = (known after apply)
      + scope                       = "REGIONAL"
      + tags                        = {
          + "Name" = "clarity-api-waf"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "clarity-api-waf"
          + "Project"     = "clarity"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "rate-limit"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "clarity-rate-limit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "aws-managed-common"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "clarity-common-rules"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "clarity-waf"
          + sampled_requests_enabled   = true
        }
    }

  # aws_wafv2_web_acl_association.api will be created
  + resource "aws_wafv2_web_acl_association" "api" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # terraform_data.ecr_seed_image will be created
  + resource "terraform_data" "ecr_seed_image" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_base_url         = (known after apply)
  + api_securities_url   = (known after apply)
  + dynamodb_table       = "clarity-securities"
  + ecr_repository_url   = (known after apply)
  + lambda_function_name = "clarity-api"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Pushed by: @Copilot*